# Dotfiles dependencies.
#
# Usage:
#   brew bundle --file Brewfile
#
# Manual prerequisites:
#   xcode-select --install
#   install Homebrew from https://brew.sh

tap "fluxcd/tap"

# Core shell/editor/terminal tools.
brew "git"
brew "curl"
brew "neovim"
brew "fzf"
brew "zoxide"
brew "eza"
brew "git-delta"
brew "ripgrep"
brew "fd"
brew "tree-sitter"
brew "tmux"

# Language runtimes and build tools used by Neovim plugins, Mason, and ftplugins.
brew "node"
brew "python"
brew "go"
brew "rustup-init"
brew "llvm"

# Formatters and linters used by conform.nvim and nvim-lint.
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "luacheck"
brew "ruff"
brew "markdownlint-cli"
brew "google-java-format"
brew "pngpaste"

# Shell workflow tools referenced by .zshrc.
brew "kubectl"
brew "helm"
brew "fluxcd/tap/flux"
brew "bun"
brew "nvm"
brew "sdkman-cli"
brew "oh-my-posh"
brew "kubecolor"
brew "xan"

# Terminal and fonts.
cask "wezterm"
cask "font-libertinus"
cask "font-jetbrains-mono-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-symbols-only-nerd-font"

# VimTeX PDF viewer.
cask "skim"

# Large optional LaTeX distribution. Uncomment if you want latexindent and TeX
# tooling managed through Homebrew instead of another TeX install.
# cask "mactex-no-gui"
